INFO - sacred_cnn_fc_3nets - Running command 'my_experiment'
INFO - sacred_cnn_fc_3nets - Started run with ID "11"
loaded dataset ../../data/training/2018-01-11T18:58:00_classification_15min_bess.npy
training data has shape (52800, 1) ; 23778 feasible and 29022 unfeasible
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 98, 1)        0                                            
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 93, 1)        0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 89, 16)       96          lambda_2[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 1424)         0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 5)            0           input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1429)         0           flatten_1[0][0]                  
                                                                 lambda_1[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           14300       concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            11          dense_1[0][0]                    
==================================================================================================
Total params: 14,407
Trainable params: 14,407
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 98, 1)        0                                            
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 93, 1)        0           input_2[0][0]                    
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 89, 16)       96          lambda_4[0][0]                   
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 1424)         0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 5)            0           input_2[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 1429)         0           flatten_2[0][0]                  
                                                                 lambda_3[0][0]                   
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 10)           14300       concatenate_2[0][0]              
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1)            11          dense_3[0][0]                    
==================================================================================================
Total params: 14,407
Trainable params: 14,407
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 98, 1)        0                                            
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 93, 1)        0           input_3[0][0]                    
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 89, 16)       96          lambda_6[0][0]                   
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 1424)         0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 5)            0           input_3[0][0]                    
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 1429)         0           flatten_3[0][0]                  
                                                                 lambda_5[0][0]                   
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 10)           14300       concatenate_3[0][0]              
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1)            11          dense_5[0][0]                    
==================================================================================================
Total params: 14,407
Trainable params: 14,407
Non-trainable params: 0
__________________________________________________________________________________________________
2018-01-12 02:45:59.434708: I tensorflow/core/platform/cpu_feature_guard.cc:137] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2 AVX AVX2 FMA
2018-01-12 02:46:00.791672: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1030] Found device 0 with properties: 
name: GeForce GTX 1070 major: 6 minor: 1 memoryClockRate(GHz): 1.7085
pciBusID: 0000:03:00.0
totalMemory: 7.92GiB freeMemory: 7.83GiB
2018-01-12 02:46:00.791703: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1120] Creating TensorFlow device (/device:GPU:0) -> (device: 0, name: GeForce GTX 1070, pci bus id: 0000:03:00.0, compute capability: 6.1)
             precision    recall  f1-score   support

        0.0     0.9525    0.9387    0.9455      7109
        1.0     0.9296    0.9453    0.9374      6091

avg / total     0.9419    0.9417    0.9418     13200

[[6673  436]
 [ 333 5758]]
Source 0:
             precision    recall  f1-score   support

        0.0     0.6005    0.7288    0.6585       660
        1.0     0.9698    0.9472    0.9584      6061

avg / total     0.9335    0.9258    0.9289      6721

Source 1:
             precision    recall  f1-score   support

        0.0     0.9979    0.9601    0.9787      6449
        1.0     0.0620    0.5667    0.1118        30

avg / total     0.9936    0.9583    0.9746      6479

INFO - sacred_cnn_fc_3nets - Result: 0.9374033374033375
INFO - sacred_cnn_fc_3nets - Completed after 0:01:08
