INFO - sacred_cnn_fc_3nets - Running command 'my_experiment'
INFO - sacred_cnn_fc_3nets - Started run with ID "6"
loaded dataset ../../data/training/2018-01-09T18:26:00_classification_15min_chp.npy
training data has shape (52800, 1) ; 19751 feasible and 33049 unfeasible
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 98, 1)        0                                            
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 93, 1)        0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 89, 16)       96          lambda_2[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 1424)         0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 5)            0           input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1429)         0           flatten_1[0][0]                  
                                                                 lambda_1[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 10)           14300       concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            11          dense_1[0][0]                    
==================================================================================================
Total params: 14,407
Trainable params: 14,407
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 98, 1)        0                                            
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 93, 1)        0           input_2[0][0]                    
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 89, 16)       96          lambda_4[0][0]                   
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 1424)         0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 5)            0           input_2[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 1429)         0           flatten_2[0][0]                  
                                                                 lambda_3[0][0]                   
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 10)           14300       concatenate_2[0][0]              
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1)            11          dense_3[0][0]                    
==================================================================================================
Total params: 14,407
Trainable params: 14,407
Non-trainable params: 0
__________________________________________________________________________________________________
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 98, 1)        0                                            
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 93, 1)        0           input_3[0][0]                    
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 89, 16)       96          lambda_6[0][0]                   
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 1424)         0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 5)            0           input_3[0][0]                    
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 1429)         0           flatten_3[0][0]                  
                                                                 lambda_5[0][0]                   
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 10)           14300       concatenate_3[0][0]              
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1)            11          dense_5[0][0]                    
==================================================================================================
Total params: 14,407
Trainable params: 14,407
Non-trainable params: 0
__________________________________________________________________________________________________
2018-01-10 17:25:09.865538: I tensorflow/core/platform/cpu_feature_guard.cc:137] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2 AVX AVX2 FMA
2018-01-10 17:25:09.868063: E tensorflow/stream_executor/cuda/cuda_driver.cc:406] failed call to cuInit: CUDA_ERROR_NO_DEVICE
2018-01-10 17:25:09.868115: I tensorflow/stream_executor/cuda/cuda_diagnostics.cc:158] retrieving CUDA diagnostic information for host: aifb-ea-deeplearning2
2018-01-10 17:25:09.868128: I tensorflow/stream_executor/cuda/cuda_diagnostics.cc:165] hostname: aifb-ea-deeplearning2
2018-01-10 17:25:09.868207: I tensorflow/stream_executor/cuda/cuda_diagnostics.cc:189] libcuda reported version is: 384.111.0
2018-01-10 17:25:09.868239: I tensorflow/stream_executor/cuda/cuda_diagnostics.cc:369] driver version file contents: """NVRM version: NVIDIA UNIX x86_64 Kernel Module  384.90  Tue Sep 19 19:17:35 PDT 2017
GCC version:  gcc version 5.4.0 20160609 (Ubuntu 5.4.0-6ubuntu1~16.04.5) 
"""
2018-01-10 17:25:09.868267: I tensorflow/stream_executor/cuda/cuda_diagnostics.cc:193] kernel reported version is: 384.90.0
2018-01-10 17:25:09.868280: E tensorflow/stream_executor/cuda/cuda_diagnostics.cc:303] kernel version 384.90.0 does not match DSO version 384.111.0 -- cannot find working devices in this configuration
             precision    recall  f1-score   support

        0.0     0.9890    0.9793    0.9841      8263
        1.0     0.9659    0.9818    0.9738      4937

avg / total     0.9804    0.9802    0.9803     13200

[[8092  171]
 [  90 4847]]
Source 0:
             precision    recall  f1-score   support

        0.0     0.9413    0.8963    0.9183      1611
        1.0     0.9667    0.9818    0.9742      4937

avg / total     0.9605    0.9608    0.9604      6548

Source 1:
/home/aifb/kabatensorflow/kabatfenv/lib/python3.5/site-packages/sklearn/metrics/classification.py:1137: UndefinedMetricWarning: Recall and F-score are ill-defined and being set to 0.0 in labels with no true samples.
  'recall', 'true', average, warn_for)
             precision    recall  f1-score   support

        0.0     1.0000    0.9994    0.9997      6652
        1.0     0.0000    0.0000    0.0000         0

avg / total     1.0000    0.9994    0.9997      6652

INFO - sacred_cnn_fc_3nets - Result: 0.9737820190858865
INFO - sacred_cnn_fc_3nets - Completed after 0:01:44
